app/Controllers/Dashboard.php

SELECT `nama`
FROM `barang`
INNER JOIN `clusters` ON `clusters`.`kode_barang` = `barang`.`kode_barang`
---
    public function graphCluster()
    {
        $fileID = $this->request->getPost('fileType');

        // dd($jumlahTransaksi, $volumePenjualan, $cluster);
        $data = $this->kmeans->getDataByFileType($fileID);

        $query = $this->barang->select('nama')->join('clusters', 'clusters.kode_barang = barang.kode_barang', 'inner')->get();