app/Controllers/KMeans.php

    public function processUpload()
    {
        $uploadedFile = $this->request->getFile('excelFile');

        // Cek apakah file berhasil diunggah
        if ($uploadedFile->isValid() && $uploadedFile->getExtension() === 'xlsx') {
            // Lakukan pemrosesan file Excel di sini
            // Misalnya, simpan file ke direktori tertentu dan proses isinya

            // Ambil informasi file
            $fileName = $uploadedFile->getName();
            $fileSize = $uploadedFile->getSize();

            // Lakukan operasi lain sesuai kebutuhan Anda
            // ...

            // Lakukan perhitungan k-means clustering
            $this->clusters = $this->kMeansClustering($uploadedFile);

            // dd($this->clusters);
            // Simpan hasil perhitungan ke database
            $this->saveClustersToDatabase($this->clusters);
            $fileID = $this->clusterModel->orderBy('file_id', 'DESC')->limit(1)->findColumn('file_id');

            // dd($fileID);
            //query cluster
            $c2 = $this->clusterModel->where('cluster', 2)->where('file_id', $fileID)->findColumn('kode_barang');
            $c1 = $this->clusterModel->where('cluster', 1)->where('file_id', $fileID)->findColumn('kode_barang');
            $c0 = $this->clusterModel->where('cluster', 0)->where('file_id', $fileID)->findColumn('kode_barang');
---
SELECT `kode_barang`
FROM `clusters`
WHERE `cluster` = 2
AND `file_id` = ('27-06-2023_11:58:49dummy_fantech.xlsx')
SELECT `kode_barang`
FROM `clusters`
WHERE `cluster` = 1
AND `file_id` = ('27-06-2023_11:58:49dummy_fantech.xlsx')
SELECT `kode_barang`
FROM `clusters`
WHERE `cluster` = 0
AND `file_id` = ('27-06-2023_11:58:49dummy_fantech.xlsx')

    private function saveClustersToDatabase($clusters)
    {
        // Simpan hasil perhitungan ke dalam database
        // Sesuaikan dengan struktur database Anda

        // Menggunakan model ClusterModel sebagai contoh

        foreach ($clusters as $cluster) {
            // Simpan data cluster ke dalam tabel cluster_result
            $this->clusterModel->insert($cluster);
---
INSERT INTO `clusters` (`file_id`, `kode_barang`, `jumlah_transaksi`, `volume_penjualan`, `cluster`) VALUES ('27-06-2023_11:58:49dummy_fantech.xlsx', '1', '10', '250', 0)