app/Models/ClusterModel.php

    public function graphJT($fileID)
    {
        $data = $this->select('DISTINCT(jumlah_transaksi)')->where('file_id', $fileID)->orderBy('jumlah_transaksi', "ASC")->findAll();
---
SELECT DISTINCT(jumlah_transaksi)
FROM `clusters`
WHERE `file_id` = '06-07-2023_11:44:04dataset_kcs.xlsx'
ORDER BY `jumlah_transaksi` ASC

    public function graphVP($fileID)
    {
        $data = $this->select('volume_penjualan')->where('file_id', $fileID)->findAll();
---
SELECT `volume_penjualan`
FROM `clusters`
WHERE `file_id` = '06-07-2023_11:44:04dataset_kcs.xlsx'