app/Models/ClusterModel.php

    public function countData($fileID)
    {
        $data = $this->select('COUNT(kode_barang) as length')->where('file_id', $fileID)->findAll();
---
SELECT COUNT(kode_barang) as length
FROM `clusters`
WHERE `file_id` = '23-07-2023_07:08:03dataset_kcs_NEW.xlsx'

    public function kode_barang($fileID)
    {
        $data = $this->select('kode_barang')->where('file_id', $fileID)->findAll();
---
SELECT `kode_barang`
FROM `clusters`
WHERE `file_id` = '23-07-2023_07:08:03dataset_kcs_NEW.xlsx'

    public function cluster($fileID)
    {
        $data = $this->select('cluster')->where('file_id', $fileID)->findAll();
---
SELECT `cluster`
FROM `clusters`
WHERE `file_id` = '23-07-2023_07:08:03dataset_kcs_NEW.xlsx'

    public function countCluster($fileID, $c)
    {
        $data = $this->select('COUNT(cluster) as cluster')->where('file_id', $fileID)->where('cluster', $c)->findAll();
---
SELECT COUNT(cluster) as cluster
FROM `clusters`
WHERE `file_id` = '23-07-2023_07:08:03dataset_kcs_NEW.xlsx'
AND `cluster` = 0

    public function getDataByFileType($fileType)
    {
        // Query data dari database berdasarkan jenis file
        $query = $this->select('jumlah_transaksi, volume_penjualan, cluster')
            ->where('file_id', $fileType)
            ->findAll();
---
SELECT `jumlah_transaksi`, `volume_penjualan`, `cluster`
FROM `clusters`
WHERE `file_id` = '23-07-2023_07:08:03dataset_kcs_NEW.xlsx'